{
  "namespace": "ransomware",
  "expanded": "ransomware types and elements",
  "description": "Ransomware is used to define ransomware types and the elements that compose them.",
  "version": 1,
  "refs": [
    "https://www.symantec.com/content/en/us/enterprise/media/security_response/whitepapers/the-evolution-of-ransomware.pdf"
  ],
  "predicates": [
    {
      "value": "type",
      "expanded": "Type",
      "description": "Type is used to describe the type of a ransomware and how it works."
    },
    {
      "value": "element",
      "expanded": "Element",
      "description": "Elements that composed or are linked to a ransomware and its execution."
    },
    {
      "value": "complexity-level",
      "expanded": "Complexity level",
      "description": "Level of complexity of the ransomware."
    }
  ],
  "values": [
    {
      "predicate": "type",
      "entry": [
        {
          "value": "scareware",
          "expanded": "Scareware is a form of malware which uses social engineering to cause shock, anxiety, or the perception of a threat in order to manipulate users into buying unwanted software."
        },
        {
          "value": "locker-ransomware",
          "expanded": "Locker eansomware, also called computer locker, denies access to the computer or device "
        },
        {
          "value": "crypto-ransomware",
          "expanded": "Crypto ransomware, also called data locker prevents access to files or data. Crypto ransomware doesn’t necessarily have to use encryption to stop users from accessing their data, but the vast majority of it does."
        }
      ]
    },
    {
      "predicate": "element",
      "entry": [
        {
          "value": "ransomnote",
          "expanded": "A ransomnote is the message left by the attacker to threaten his victim and ask for ransom. It is usually seen as a text file or a picture set as background."
        },
        {
          "value": "dropper",
          "expanded": "A dropper is a means of getting malware into a machine while bypassing the security checks by carring the malware inside of itself."
        },
        {
          "value": "downloader",
          "expanded": "a downloader is a means of getting malware into a machine while bypassing the security checks, by downloading it instead of carring it."
        }
      ]
    },
    {
      "predicate": "complexity-level",
      "entry": [
        {
          "value": "no-actual-encryption-fake-scareware",
          "expanded": "No actual encryption (fake scareware). infection merely poses as a ransomware by displaying a ransom note while not actually encrypting user files"
        },
        {
          "value": "display-ransomnote-before-encrypting",
          "expanded": "Displaying the ransom note before encryption process commences. As seen in the case of Nemucod, some ransomware will display a ransom note before file encryption. This is a serious operational flaw in the ransomware. The victim or their antivirus solution could effectively take prompt evasive action to prevent ransomware from commencing encryption."
        },
        {
          "value": "",
          "expanded": ""
        },
        {
          "value": "",
          "expanded": ""
        },
        {
          "value": "",
          "expanded": ""
        },
        {
          "value": "",
          "expanded": ""
        },
        {
          "value": "",
          "expanded": ""
        },
        {
          "value": "",
          "expanded": ""
        },
        {
          "value": "",
          "expanded": ""
        },

      ]
    }
  ]
}
