{
  "namespace": "estimative-language",
  "expanded": "Estimative languages",
  "description": "Estimative language to describe quality and credibility of underlying sources, data, and methodologies based Intelligence Community Directive 203 (ICD 203) and JP 2-0, Joint Intelligence",
  "version": 5,
  "predicates": [
    {
      "value": "likelihood-probability",
      "expanded": "Likelihood or probability",
      "description": "Properly expresses and explains uncertainties associated with major analytic judgments: Analytic products should indicate and explain the basis for the uncertainties associated with major analytic judgments, specifically the likelihood of occurrence of an event or development, and the analyst's confidence in the basis for this judgment. Degrees of likelihood encompass a full spectrum from remote to nearly certain. Analysts' confidence in an assessment or judgment may be based on the logic and evidentiary base that underpin it, including the quantity and quality of source material, and their understanding of the topic. Analytic products should note causes of uncertainty (e.g., type, currency, and amount of information, knowledge gaps, and the nature of the issue) and explain how uncertainties affect analysis (e.g., to what degree and how a judgment depends on assumptions). As appropriate, products should identify indicators that would alter the levels of uncertainty for major analytic judgments. Consistency in the terms used and the supporting information and logic advanced is critical to success in expressing uncertainty, regardless of whether likelihood or confidence expressions are used.",
      "exclusive": true
    },
    {
      "value": "confidence-in-analytic-judgment",
      "expanded": "Confidence in analytic judgment",
      "description": "Confidence in a judgment is based on three factors:   number of key assumptions required, the credibility and diversity of sourcing in the knowledge base, and the strength of argumentation. Each factor should be assessed independently and then in concert with the other factors to determine the confidence level. Multiple judgments in a product may contain varying levels of confidence. Confidence levels are stated as Low, Moderate, and High.",
      "exclusive": true
    }
  ],
  "values": [
    {
      "predicate": "likelihood-probability",
      "entry": [
        {
          "value": "almost-no-chance",
          "expanded": "Almost no chance - remote - 01-05%",
          "numerical_value": 0
        },
        {
          "value": "very-unlikely",
          "expanded": "Very unlikely - highly improbable - 05-20%",
          "numerical_value": 5
        },
        {
          "value": "unlikely",
          "expanded": "Unlikely - improbable (improbably) - 20-45%",
          "numerical_value": 20
        },
        {
          "value": "roughly-even-chance",
          "expanded": "Roughly even change - roughly even odds - 45-55%",
          "numerical_value": 45
        },
        {
          "value": "likely",
          "expanded": "Likely - probable (probably) - 55-80%",
          "numerical_value": 55
        },
        {
          "value": "very-likely",
          "expanded": "Very likely - highly probable - 80-95%",
          "numerical_value": 80
        },
        {
          "value": "almost-certain",
          "expanded": "Almost certain(ly) - nearly certain - 95-99%",
          "numerical_value": 95
        }
      ]
    },
    {
      "predicate": "confidence-in-analytic-judgment",
      "entry": [
        {
          "value": "low",
          "expanded": "Low",
          "description": "Uncorroborated information from good or marginal sources. Many assumptions. Mostly weak logical inferences, minimal methods application. Glaring intelligence gaps exist. Terms or expressions used: 'Possible', 'Could, may, might', 'Cannot judge, unclear.'",
          "numerical_value": 0
        },
        {
          "value": "moderate",
          "expanded": "Moderate",
          "description": "Partially corroborated information from good sources. Several assumptions. Mix of strong and weak inferences and methods. Minimum intelligence gaps exist. Terms or expressions used: 'Likely, unlikely', 'Probable, improbable' 'Anticipate, appear'.",
          "numerical_value": 55
        },
        {
          "value": "high",
          "expanded": "High",
          "description": "Well-corroborated information from proven sources. Minimal assumptions. Strong logical inferences and methods. No or minor intelligence gaps exist. Terms or expressions used: 'Will, will not', 'Almost certainly, remote', 'Highly likely, highly unlikely', 'Expect, assert, affirm'.",
          "numerical_value": 95
        }
      ]
    }
  ]
}
