{
  "namespace": "cycat",
  "expanded": " Universal Cybersecurity Resource Catalogue",
  "description": "Taxonomy used by cycat (Universal Cybersecurity Resource Catalogue) to categorize namespaces available in their cybersecurity catalogue.",
  "version": 1,
  "refs": [
    "https://www.cycat.org/"
  ],
  "values": [
    {
      "predicate": "type",
      "entry": [
        {
          "value": "tool",
          "expanded": "Tool",
          "description": "Cybersecurity tool is an open source or proprietaty tool used in the cybersecurity scope."
        },
        {
          "value": "playbook",
          "expanded": "Playbook",
          "description": "Cybersecurity playbook such as a defined set of rules with one or more actions triggered by different events to respond to, orchestrate or automate cybersecurity related actions."
        },
        {
          "value": "taxonomy",
          "expanded": "Taxonomy",
          "description": "Cybersecurity taxonomy is a set of labels used to classify (in both terms - arrange in classes or/and design to national classification) cybersecurity related information."
        },
        {
          "value": "ruleset",
          "expanded": "Ruleset",
          "description": "Cybersecurity rulesets are rules used for detection in the cybersecurity field. Rulesets can be in different formats for (N/L)IDS/SIEM (such as Snort, Suricata, Zeek, Sigma, Yara format) or any other tool capable of parsing such a ruleset."
        },
        {
          "value": "notebook",
          "expanded": "Notebook",
          "description": "Cybersecurity notebook is an interactive document to code, experiment, train or visualize cybersecurity related information. A notebook can be transcribed in a format such as Jupyter Notebooks, Apache Zeppelin, Google Colab."
        },
        {
          "value": "vulnerability",
          "expanded": "Vulnerability",
          "description": "Vulnerability is a known (public or non-public) information about a security vulnerability in a specific software, hardware or service."
        },
        {
          "value": "proof-of-concept",
          "expanded": "Proof-of-concept",
          "description": "Cybersecurity proof-of-concept is a validation code to a known vulnerability."
        },
        {
          "value": "fingerprint",
          "expanded": "Fingerprint",
          "description": "Cybersecurity fingerprints are codes to uniquely identify specific cybersecurity-relevant patterns. Fingerprints can be expressed in different formats such as ja3, ja3s, hassh, jarm, favicon-mmh3."
        }
      ]
    },
    {
      "predicate": "scope",
      "entry": [
        {
          "value": "protection",
          "expanded": "Protection"
        },
        {
          "value": "detection",
          "expanded": "Detection"
        },
        {
          "value": "exploitation",
          "expanded": "Exploitation"
        },
        {
          "value": "investigation",
          "expanded": "Investigation"
        },
        {
          "value": "training",
          "expanded": "Training"
        }
      ]
    }
  ],
  "predicates": [
    {
      "value": "type",
      "expanded": "Type",
      "description": "Type of entry in the catalogue."
    },
    {
      "value": "scope",
      "expanded": "Scope",
      "description": "Scope of usage for the entry in the catalogue."
    }
  ]
}
